In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('data/Location.csv', squeeze=True)
location_data = data.copy()
location_data.head()

C:\Users\Palmg\AppData\Local\Temp\ipykernel_336\1700189749.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  data = pd.read_csv('Location.csv', squeeze=True)

0     Location 3
1     Location 6
2     Location 8
3    Location 26
4    Location 34
Name: Location, dtype: object

In [3]:
type(location_data)

pandas.core.series.Series

In [4]:
location_data.describe()

count            1043
unique            296
top       Location 25
freq               31
Name: Location, dtype: object

# ILOC

In [13]:
data_1 = pd.read_csv('data/Lending-company.csv')
lending_data = data_1.copy()
lending_data.head()

,LoanID,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
0,1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
1,2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
2,3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
3,4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
4,5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [14]:
# 2nd row
lending_data.iloc[1]

LoanID                     2
StringID            LoanID_2
Product            Product D
CustomerGender        Female
Location          Location 6
Region              Region 6
TotalPrice               NaN
StartDate         02/01/2019
Deposit                 2200
DailyRate                 45
TotalDaysYr              365
AmtPaid36               3161
AmtPaid60               4096
AmtPaid360             16041
LoanStatus            Active
Name: 1, dtype: object

In [15]:
# 2nd row, 4th column
lending_data.iloc[1,3]

'Female'

In [16]:
# Row 1, all columns | Type: Series
lending_data.iloc[1, :]

LoanID                     2
StringID            LoanID_2
Product            Product D
CustomerGender        Female
Location          Location 6
Region              Region 6
TotalPrice               NaN
StartDate         02/01/2019
Deposit                 2200
DailyRate                 45
TotalDaysYr              365
AmtPaid36               3161
AmtPaid60               4096
AmtPaid360             16041
LoanStatus            Active
Name: 1, dtype: object

In [17]:
# all rows, column 4 | Type Series
lending_data.iloc[:, 3]

0             Female
1             Female
2               Male
3               Male
4             Female
            ...
1038            Male
1039            Male
1040    NotSpecified
1041          Female
1042    NotSpecified
Name: CustomerGender, Length: 1043, dtype: object

In [18]:
# Rows 2 and 4, all columns
lending_data.iloc[[1, 3], :]

,LoanID,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
1,2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
3,4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active

In [20]:
# All rows, columns 2 and 4
lending_data.iloc[:, [1, 3]]

         StringID CustomerGender
0        LoanID_1         Female
1        LoanID_2         Female
2        LoanID_3           Male
3        LoanID_4           Male
4        LoanID_5         Female
...           ...            ...
1038  LoanID_1039           Male
1039  LoanID_1040           Male
1040  LoanID_1041   NotSpecified
1041  LoanID_1042         Female
1042  LoanID_1043   NotSpecified

[1043 rows x 2 columns]

# LOC

In [22]:
data_1 = pd.read_csv('data/Lending-company.csv', index_col = 'StringID')
lending_data = data_1.copy()
lending_data.head()

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_2,2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
LoanID_3,3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
LoanID_4,4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
LoanID_5,5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [23]:
# Row with StringID: 'LoanID_3'
lending_data.loc['LoanID_3']

LoanID                     3
Product            Product B
CustomerGender          Male
Location          Location 8
Region              Region 3
TotalPrice           16600.0
StartDate         08/12/2016
Deposit                 1000
DailyRate                 45
TotalDaysYr              365
AmtPaid36               2260
AmtPaid60               3205
AmtPaid360             16340
LoanStatus               NaN
Name: LoanID_3, dtype: object

In [24]:
# Row with SID LoanID_3 all columns
lending_data.loc['LoanID_3', :]

LoanID                     3
Product            Product B
CustomerGender          Male
Location          Location 8
Region              Region 3
TotalPrice           16600.0
StartDate         08/12/2016
Deposit                 1000
DailyRate                 45
TotalDaysYr              365
AmtPaid36               2260
AmtPaid60               3205
AmtPaid360             16340
LoanStatus               NaN
Name: LoanID_3, dtype: object

In [25]:
# LoanID_3 row, Region column
lending_data.loc['LoanID_3', 'Region']

'Region 3'

In [27]:
# All rows, column location
lending_data.loc[:,'Location']

StringID
LoanID_1        Location 3
LoanID_2        Location 6
LoanID_3        Location 8
LoanID_4       Location 26
LoanID_5       Location 34
                  ...
LoanID_1039    Location 73
LoanID_1040    Location 82
LoanID_1041    Location 11
LoanID_1042    Location 26
LoanID_1043    Location 94
Name: Location, Length: 1043, dtype: object